# Напишите программу, которая найдёт произведение пар чисел списка.
#  Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

import random

s = int(input('введите целое положительное число ')) 
# print(s)
i = 0
arr =[]
arr2 =[]
while i <= s-1:
    r = random.randint(0, 125)
    # print(r)
    i=i+1
    arr.append(r)
print(f'список {arr}')
i = 0
j=s-1
while i<=s-1 and i!=j and i<j:
    r=arr[i]*arr[j]
    arr2.append(r)
    i=i+1
    j = j-1
print(f'парные произвидения {arr2}')


